{"id": "9246", "authors": ["Murphy", "Janet"], "ai": 2.0, "name": "Reduce automatic sortition events v1.1", "text": "\nAmend Rule 2691 (Sortition Procedure) by replacing this text:\n\n      Seven days after a sortition is initiated, its lots period ends.\n      The ADoP CAN by announcement, and SHALL in a timely fashion after\n      a lots period ends, randomly select one of the options for that\n      office. When e does so, that player becomes the officeholder for\n      that office, then the sortition ends.\n\n      If a sortition's lots period has ended, and the sortition has no\n      valid options, then it immediately ends with no selection, and any\n      duty to select an option with respect to it is discharged.\n\nor, if Proposal 9245 was adopted, this text:\n\n      Seven days after a sortition is initiated, its lots period ends.\n\n        * If it has two or more valid options, then the ADoP CAN by\n          announcement, and SHALL in a timely fashion after its lots\n          period ends, randomly select one of those options.\n\n        * If it has exactly one valid option, then any player CAN by\n          announcement select that option.\n\n        * If it has no valid options, then any player CAN by\n          announcement declare the selection ended with no selection.\n\n      When a player is selected in a sortition as described above, e is\n      installed into the associated office and the election ends.\n\nwith this text:\n\n      Seven days after a sortition is initiated, its lots period ends,\n      after which:\n\n        * If it has two or more valid options, then the ADoP CAN by\n          announcement, and SHALL in a timely fashion after its lots\n          period ends, randomly select one of those options.\n\n        * If it has exactly one valid option, then any player CAN by\n          announcement select that option.\n\n        * If it has no valid options, then any player CAN by\n          announcement declare the sortition ended with no selection.\n\n      When a player is selected in a sortition as described above, e is\n      installed into the associated office and the sortition ends.\n"}